src/Documents/Scan_Калькуляция/Scan_Калькуляция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_Калькуляция</name>
  <basedOn>Document.Scan_Калькуляция</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторПрайсЛиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПрайсЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетСДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетСPartPeriod</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентDealerNet</name>
    <type>
      <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентRetailPrice</name>
    <type>
      <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыКалькуляций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_Калькуляция</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НерасчетныеСоставляющие</name>
    <attributes>
      <name>РазделКалькуляции</name>
      <type>
        <types>CatalogRef.Scan_РазделыКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>Принадлежность</name>
      <type>
        <types>EnumRef.Scan_ПринадлежностьСоставляющихКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиКалькуляции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставляющаяРасчета</name>
      <type>
        <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеСоставляющие</name>
    <attributes>
      <name>РазделКалькуляции</name>
      <type>
        <types>CatalogRef.Scan_РазделыКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>Принадлежность</name>
      <type>
        <types>EnumRef.Scan_ПринадлежностьСоставляющихКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиКалькуляции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставляющаяРасчета</name>
      <type>
        <types>CatalogRef.Scan_СоставляющиеРасчетаЦеныПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормулаРасчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартныеСпецификации</name>
    <attributes>
      <name>РазделКалькуляции</name>
      <type>
        <types>CatalogRef.Scan_РазделыКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьБазовыхОпций</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьНадстройки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьОборудования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Scan_Калькуляция/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Scan_Калькуляция") Тогда
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		ХозОперация = ПредопределенноеЗначение("Справочник.Scan_ХозяйственныеОперации.РасчетОтПрайсЛиста");
		
		//rarus agar 26.10.2020 15690 ++
		// Закомментировал, т.к. для вводимого на основании документа ХО - Расчет от прайс-листа
		// Группа ГруппаПараметрыПрайсЛиста не отображается
		//ИдентификаторПрайсЛиста = ДанныеЗаполнения.ИдентификаторПрайсЛиста;
		//НаименованиеПрайсЛиста  = ДанныеЗаполнения.НаименованиеПрайсЛиста;
		//ДействуетСДаты          = ДанныеЗаполнения.ДействуетСДаты;
		//ДействуетСPartPeriod    = ДанныеЗаполнения.ДействуетСPartPeriod;
		//rarus agar 26.10.2020 15690 --
		
		НерасчетныеСоставляющие.Загрузить(ДанныеЗаполнения.НерасчетныеСоставляющие.Выгрузить());
		РасчетныеСоставляющие.Загрузить(ДанныеЗаполнения.РасчетныеСоставляющие.Выгрузить());
		СтандартныеСпецификации.Загрузить(ДанныеЗаполнения.СтандартныеСпецификации.Выгрузить());
	Иначе
		ХозОперация = ПредопределенноеЗначение("Справочник.Scan_ХозяйственныеОперации.ИзменениеСтатейПрайсЛиста");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДействуетСPartPeriod) Тогда 
		Отказ = РегистрыСведений.Scan_ИнформацияПоPartPeriod.ПроверитьПартПериод(ДействуетСPartPeriod);
		Если Отказ Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	//rarus agar 14.05.2020  15466 Доп1 ++
	Если  ЗначениеЗаполнено(ДействуетСДаты)
		И ЗначениеЗаполнено(ДействуетСPartPeriod)
		И Не Scan_ЦенообразованиеСервер.ДатаСоответствуетPartPeriod(ДействуетСДаты, ДействуетСPartPeriod) 
		Тогда
		Сообщить(НСтр("ru = 'Указанный Part Period не соответствует дате начала действия'; en = 'The Part Period does not match the From Date'"));
		Отказ = Истина;
	КонецЕсли;
	//rarus agar 14.05.2020  15466 Доп1 --
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПометкаУдаления Тогда
		Статус = ПредопределенноеЗначение("Справочник.Scan_СтатусыКалькуляций.РасчетАннулирован");
	КонецЕсли;
	
КонецПроцедуры
